# -*- coding: utf-8 -*-

USERID = 'userId'
PASSWD = 'password'

# Server URL
DOMAIN = "http://g03.dragon.vector.jp/"

# Hero ID
MYHEROS = ['24762','26915','27811','31744']

# 自殺閾値
STOP_HUNT_HP_BORDER = 3.0

# should fix
CATSLE_X = 43
CATSLE_Y = -43

#悪魔城優先 = true, ランダム = false
AKUMA = true

# 狩りにでかける座標
VECTORS = [
           [0,   0], # 中心
           [11, -9], # １マップ上
           [11, -9], # 右上
           [11,  0], # 右
           [11,  9], # 右下
           [0,   9], # 下
           [-11, 9], # 左下
           [-11, 0], # 左
           [-11,-9], # 右上
           [0,  -9], # 上
           ]

# VECTORS = [
#            [-22, -18],
#            [-22,  18],
#            [22,  -18],
#            [22,   18],
#            [-33,  9],
#            [-33,  0],
#            [-33, -9],
#            [33,   9],
#            [33,   0],
#            [33,  -9],
#            [-11, 27],
#            [0,   27],
#            [11,  27],
#            [-11,-27],
#            [0,  -27],
#            [11, -27]
#           ]
